Revit 2027 API
ConnectionInputPointInfo.InputMemberIndex Property
 A index of the input member to which the restriction applies.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int InputMemberIndex { get; set; }
Public Property InputMemberIndex As Integer
	Get
	Set
public:
property int InputMemberIndex {
	int get ();
	void set (int value);
}
member InputMemberIndex : int with get, set
Property Value
Int32
See Also
Reference
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace